app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."author_id" = $1  [["author_id", "3"]]
---
  def index
    @notes = Note.where(author_id: params[:user_id])

INSERT INTO "notes" ("body", "author_id", "created_at", "updated_at", "title") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is a new note!"], ["author_id", "3"], ["created_at", "2021-07-07 22:56:57.270353"], ["updated_at", "2021-07-07 22:56:57.270353"], ["title", "new note!"]]
---
  def create
    @note = Note.new(note_params)
    @note.author_id = current_user.id
    if @note.save