app/controllers/users_controller.rb

  def create
    debugger
    if password_confirmation[:password_confirmation] == user_params[:password]
      @user = User.new(user_params)
      if @user.save!
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"